In [3]:
import pandas as pd
test_df = pd.read_csv('data.csv',sep=';')
test_df

  Unnamed: 0  Column1  Column2  Column3  Column4
0       Row1        0        1        2        3
1       Row2        4        5        6        7
2       Row3        8        9       10       11
3       Row4       12       13       14       15

In [4]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   Column1     4 non-null      int64
 2   Column2     4 non-null      int64
 3   Column3     4 non-null      int64
 4   Column4     4 non-null      int64
dtypes: int64(4), object(1)
memory usage: 292.0+ bytes

In [5]:
test_df.describe()

         Column1    Column2    Column3    Column4
count   4.000000   4.000000   4.000000   4.000000
mean    6.000000   7.000000   8.000000   9.000000
std     5.163978   5.163978   5.163978   5.163978
min     0.000000   1.000000   2.000000   3.000000
25%     3.000000   4.000000   5.000000   6.000000
50%     6.000000   7.000000   8.000000   9.000000
75%     9.000000  10.000000  11.000000  12.000000
max    12.000000  13.000000  14.000000  15.000000

In [6]:
test_df.value_counts('Column1')

Column1
0     1
4     1
8     1
12    1
Name: count, dtype: int64

In [7]:
test_df[test_df['Column1']>5]

  Unnamed: 0  Column1  Column2  Column3  Column4
2       Row3        8        9       10       11
3       Row4       12       13       14       15

CSV

In [8]:
from io import StringIO, BytesIO
import numpy as np

In [9]:
data = ('col1,col2,col3\n'
        'x,y,1\n'
        'a,b,2\n'
        'c,d,3\n')

In [10]:
type(data)

str

In [11]:
df = pd.read_csv(StringIO(data))
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [12]:
df1= pd.read_csv(StringIO(data), usecols=['col1','col3'])
df1

  col1  col3
0    x     1
1    a     2
2    c     3

In [13]:
df1.to_csv('test.csv')

In [14]:
df=pd.read_csv(StringIO(data),usecols=['col3'], dtype=float)
df

   col3
0   1.0
1   2.0
2   3.0

In [15]:
df=pd.read_csv(StringIO(data), dtype={'col3':float})
df

  col1 col2  col3
0    x    y   1.0
1    a    b   2.0
2    c    d   3.0

In [16]:
df.dtypes

col1     object
col2     object
col3    float64
dtype: object

In [17]:
data =  ('index,a,b,c\n'
         '4,apple,bat,5.7\n'
         '8,orange,cow,10')

In [18]:
df2= pd.read_csv(StringIO(data), index_col=0)
df2

            a    b     c
index
4       apple  bat   5.7
8      orange  cow  10.0

In [19]:
data =  ('a,b,c\n'
         '4,apple,bat\n'
         '8,orange,cow')

In [20]:
df3= pd.read_csv(StringIO(data))
df3

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [21]:
import pandas as pd
Data = '{"employee_name": "James", "email": "james@gmail.com", "job_profile": [{"title1":"Team Lead","title2":"Sr. Developer"}]}'
pd.read_json(Data)

C:\Users\tinus\AppData\Local\Temp\ipykernel_14508\3845280227.py:3: FutureWarning: Passing literal json to 'read_json' is deprecated and will be removed in a future version. To read from a literal string, wrap it in a 'StringIO' object.
  pd.read_json(Data)

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr. Develop..."

In [23]:
url = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"

df4 = pd.read_html(url)
df4

[                             Bank NameBank       CityCity StateSt  CertCert  \
 0    Republic First Bank dba Republic Bank   Philadelphia      PA     27332
 1                            Citizens Bank       Sac City      IA      8758
 2                 Heartland Tri-State Bank        Elkhart      KS     25851
 3                      First Republic Bank  San Francisco      CA     59017
 4                           Signature Bank       New York      NY     57053
 ..                                     ...            ...     ...       ...
 564                     Superior Bank, FSB       Hinsdale      IL     32646
 565                    Malta National Bank          Malta      OH      6629
 566        First Alliance Bank & Trust Co.     Manchester      NH     34264
 567      National State Bank of Metropolis     Metropolis      IL      3815
 568                       Bank of Honolulu       Honolulu      HI     21029

                  Acquiring InstitutionAI Closing DateClosing  FundFund
 0      Fulton Bank, National Association      April 26, 2024     10546
 1              Iowa Trust & Savings Bank    November 3, 2023     10545
 2                 Dream First Bank, N.A.       July 28, 2023     10544
 3              JPMorgan Chase Bank, N.A.         May 1, 2023     10543
 4                    Flagstar Bank, N.A.      March 12, 2023     10540
 ..                                   ...                 ...       ...
 564                Superior Federal, FSB       July 27, 2001      6004
 565                    North Valley Bank         May 3, 2001      4648
 566  Southern New Hampshire Bank & Trust    February 2, 2001      4647
 567              Banterra Bank of Marion   December 14, 2000      4646
 568                   Bank of the Orient    October 13, 2000      4645

 [569 rows x 7 columns]]

In [24]:
df4.to_json()

AttributeError: 'list' object has no attribute 'to_json'